Tekla.Structures.Drawing.TextFile.TextFileAttributes
The TextFileAttributes class contains the attributes for the text file object.

Tekla.Structures.Drawing.TextFile.TextFileAttributes.Font
Gets or sets the font.
Tekla.Structures.Drawing.FontAttributes

Tekla.Structures.Drawing.TextFile.TextFileAttributes.Line
Gets or sets the line type.
Tekla.Structures.Drawing.LineTypeAttributes

Tekla.Structures.Drawing.TextFile.TextFileAttributes.LineType
Deprecated, use Line instead

Tekla.Structures.Drawing.TextFile.TextFileAttributes.Scaling
Gets or sets the scaling.
Tekla.Structures.Drawing.ScalingOptions

Tekla.Structures.Drawing.TextFile.TextFileAttributes.#ctor(System.Boolean)
Initializes a new instance of the text file attributes class that may load standard attributes.

Tekla.Structures.Drawing.TextFile.TextFileAttributes.#ctor
Creates a new text file attributes instance that loads standard attributes.

Tekla.Structures.Drawing.TextFile.TextFileAttributes.LoadAttributes(System.String)
Loads the specified attribute file.
AttributeFile: The name of the attribute file.
Returns: True if succeeded.

Tekla.Structures.Drawing.TextFile.TextFileAttributes.IsEqual(System.Object)
Compares the current object with an object of the same type.
ObjectToCompare: The object to be used for comparing.
Returns: True if all the fields (except for the database GUID) of the objects match.